
## Plan Result

[CI link](https://github.com/shimizu-atsuyoshi/live-fire-exercise/actions/runs/16313377100)


<pre><code>Plan: 13 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.internet_gateway.aws_internet_gateway.this
  * module.private_subnets.aws_subnet.this[&#34;live-fire-exercise-private-subnet-a&#34;]
  * module.private_subnets.aws_subnet.this[&#34;live-fire-exercise-private-subnet-c&#34;]
  * module.private_subnets.aws_subnet.this[&#34;live-fire-exercise-private-subnet-d&#34;]
  * module.public_subnets.aws_subnet.this[&#34;live-fire-exercise-public-subnet-a&#34;]
  * module.public_subnets.aws_subnet.this[&#34;live-fire-exercise-public-subnet-c&#34;]
  * module.public_subnets.aws_subnet.this[&#34;live-fire-exercise-public-subnet-d&#34;]
  * module.route_table.aws_route.this
  * module.route_table.aws_route_table.this
  * module.route_table.aws_route_table_association.this[&#34;0&#34;]
  * module.route_table.aws_route_table_association.this[&#34;1&#34;]
  * module.route_table.aws_route_table_association.this[&#34;2&#34;]
  * module.vpc.aws_vpc.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.internet_gateway.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "ap-northeast-1"
      + tags     = {
          + "Name" = "live-fire-exercise"
        }
      + tags_all = {
          + "Name" = "live-fire-exercise"
        }
      + vpc_id   = (known after apply)
    }

  # module.private_subnets.aws_subnet.this["live-fire-exercise-private-subnet-a"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags                                           = {
          + "Name" = "live-fire-exercise-private-subnet-a"
        }
      + tags_all                                       = {
          + "Name" = "live-fire-exercise-private-subnet-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.private_subnets.aws_subnet.this["live-fire-exercise-private-subnet-c"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags                                           = {
          + "Name" = "live-fire-exercise-private-subnet-c"
        }
      + tags_all                                       = {
          + "Name" = "live-fire-exercise-private-subnet-c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.private_subnets.aws_subnet.this["live-fire-exercise-private-subnet-d"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags                                           = {
          + "Name" = "live-fire-exercise-private-subnet-d"
        }
      + tags_all                                       = {
          + "Name" = "live-fire-exercise-private-subnet-d"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_subnets.aws_subnet.this["live-fire-exercise-public-subnet-a"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags                                           = {
          + "Name" = "live-fire-exercise-public-subnet-a"
        }
      + tags_all                                       = {
          + "Name" = "live-fire-exercise-public-subnet-a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_subnets.aws_subnet.this["live-fire-exercise-public-subnet-c"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags                                           = {
          + "Name" = "live-fire-exercise-public-subnet-c"
        }
      + tags_all                                       = {
          + "Name" = "live-fire-exercise-public-subnet-c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_subnets.aws_subnet.this["live-fire-exercise-public-subnet-d"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags                                           = {
          + "Name" = "live-fire-exercise-public-subnet-d"
        }
      + tags_all                                       = {
          + "Name" = "live-fire-exercise-public-subnet-d"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.route_table.aws_route.this will be created
  + resource "aws_route" "this" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "ap-northeast-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.route_table.aws_route_table.this will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-northeast-1"
      + route            = (known after apply)
      + tags             = {
          + "Name" = "live-fire-exercise"
        }
      + tags_all         = {
          + "Name" = "live-fire-exercise"
        }
      + vpc_id           = (known after apply)
    }

  # module.route_table.aws_route_table_association.this["0"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-northeast-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.this["1"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-northeast-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.this["2"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-northeast-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "192.168.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "ap-northeast-1"
      + tags                                 = {
          + "Name" = "live-fire-exercise"
        }
      + tags_all                             = {
          + "Name" = "live-fire-exercise"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label add-or-update: POST https://api.github.com/repos/shimizu-atsuyoshi/live-fire-exercise/issues/4/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"aws-plan","PRNumber":4,"Program":"tfcmt","SHA1":"27a8f55424b553706a2defca201d9e400bd0a2e1","Vars":{},"WorkflowName":"aws plan"} -->